Repository: Gabriela-sdgku/MDI-115
Catalog: MDI 115/*.xliff
Languages: ar

source: HStack Adaptability
ar: تكيف الـ HStack

source: Hello, World!
ar: مرحباً بالعالم!

source: Layout Direction
ar: اتجاه التخطيط

source: List Item Flow
ar: تدفق عناصر القائمة

source: RTL/LTR Layout Tester
ar: مختبر تخطيط RTL/LTR

source: Semantic Padding
ar: الحشوة الدلالية

source: Text Field Alignment
ar: محاذاة حقل النص

source: Toggle this switch to simulate how your UI adapts between Left-to-Right (e.g., English) and Right-to-Left (e.g., Arabic) languages. Observe automatic flipping of elements and text alignment.
ar: قم بتبديل هذا المفتاح لمحاكاة كيفية تكيف واجهة المستخدم الخاصة بك بين اللغات من اليسار إلى اليمين (مثل الإنجليزية) ومن اليمين إلى اليسار (مثل العربية). لاحظ الانعكاس التلقائي للعناصر ومحاذاة النص.

source: enter.name.placeholder
ar: أدخل الاسم

source: greeting
ar: مرحباً

source: item.one
ar: العنصر الأول

source: item.three
ar: العنصر الثالث

source: item.two
ar: العنصر الثاني

source: leading.padding.example
ar: نص يوضح الحشوة البادئة
